docs/recipes/mediterranean-baked-sweet-potatoes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mediterranean Baked Sweet Potatoes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/spoon.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Mediterranean Baked Sweet Potatoes</h1>
<p>
<a href="https://minimalistbaker.com/mediterranean-baked-sweet-potatoes/">Original link</a>
</p>

<div id="outline-container-orgf6eb6fe" class="outline-2">
<h2 id="orgf6eb6fe">Ingredients</h2>
<div class="outline-text-2" id="text-orgf6eb6fe">
<ul class="org-ul">
<li>4 medium sweet potatoes* (~140 g each)</li>
<li>1 can (400 g) chickpeas, rinsed and drained</li>
<li>1/2 Tbsp olive oil</li>
<li>1/2 tsp each cumin, coriander, cinnamon, smoked (or regular) paprika</li>
<li>optional: Pinch of sea salt or lemon juice</li>
</ul>
</div>

<div id="outline-container-org349bd41" class="outline-3">
<h3 id="org349bd41">Garlic herb sauce</h3>
<div class="outline-text-3" id="text-org349bd41">
<ul class="org-ul">
<li>1/4 cup (60 g) hummus (or tahini)</li>
<li>juice of 1/2 lemon (~1 Tbsp)</li>
<li>3/4 - 1 tsp dried dill (or sub 2-3 tsp fresh)</li>
<li>3 cloves garlic, minced (1 1/2 Tbsp or 9 g)</li>
<li>Water or unsweetened almond milk to thin</li>
<li>optional: Sea salt to taste (I didn't need any)</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe95246" class="outline-3">
<h3 id="orgfe95246">Toppings</h3>
<div class="outline-text-3" id="text-orgfe95246">
<ul class="org-ul">
<li>1/4 cup (45 g) cherry tomatoes, diced</li>
<li>1/4 cup (15 g) chopped parsley, minced</li>
<li>2 Tbsp (30 ml) lemon juice</li>
<li>Chili garlic sauce</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd480ea4" class="outline-2">
<h2 id="orgd480ea4">Instructions</h2>
<div class="outline-text-2" id="text-orgd480ea4">
<ol class="org-ol">
<li>Preheat oven to 400 degrees and line a large baking sheet with foil.</li>
<li>Rinse and scrub potatoes and cut in half length wise. This will speed cooking time. Otherwise leave whole and bake longer (approximately double the time (45 min - 1 hour).</li>
<li>Toss rinsed and drained chickpeas with olive oil and spices and place on a foil-lined baking sheet.</li>
<li>Rub the sweet potatoes with a bit of olive oil and place face down on the same baking sheet (or another baking sheet depending on size).</li>
<li>While the sweet potatoes and chickpeas are roasting, prepare your sauce by adding all ingredients to a mixing bowl and whisking to combine, only adding enough water to almond milk to thin so it's pourable. Taste and adjust seasonings as needed. Add more garlic for more zing, salt for savoriness, lemon juice for freshness, and dill for a more intense herb flavor. I found mine didn't need anything else.</li>
<li>NOTE: If you don't have hummus, tahini will make a great base substitute for the sauce - just adjust the seasonings to accommodate the lack of flavor tahini provides.</li>
<li>Also prepare the parsley-tomato topping by tossing tomato and parsley with lemon juice and setting aside to marinate.</li>
<li>Once sweet potatoes are fork tender and the chickpeas are golden brown - roughly 25 minutes - remove from oven.</li>
<li>For serving, flip potatoes flesh-side up and smash down the insides a little bit. Then top with chickpeas, sauce and parsley-tomato garnish. Serve immediately.</li>
<li>Additional side ideas might include Hummus, Pita Chips, Baba Ganoush, or Persian Eggplant Dip. Enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
